---
kind: property
id: P:Autodesk.Revit.DB.Curve.Reference
zh: 曲线
source: html/d5e10517-24fa-4627-43be-8981746d30c8.htm
---
# Autodesk.Revit.DB.Curve.Reference Property

**中文**: 曲线

Returns a stable reference to the curve.

## Syntax (C#)
```csharp
public Reference Reference { get; }
```

## Remarks
This value is also if the corresponding geometry object does not permit referencing.